
<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
      
      
        <link rel="canonical" href="https://chrischen2023.github.io/multi_lang_test/main/3.ngql-guide/6.functions-and-expressions/4.schema/">
      
      
      
      
      <link rel="icon" href="https://docs-cdn.nebula-graph.com.cn/figures/favicon.ico">
      <meta name="generator" content="mkdocs-1.5.3, mkdocs-material-9.4.6">
    
    
      
        <title>Schema-related functions - Chris Docs</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/main.35e1ed30.min.css">
      
        
        <link rel="stylesheet" href="../../../assets/stylesheets/palette.356b1318.min.css">
      
      


    
    
      
    
    
      
        
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,300i,400,400i,700,700i%7CRoboto+Mono:400,400i,700,700i&display=fallback">
        <style>:root{--md-text-font:"Roboto";--md-code-font:"Roboto Mono"}</style>
      
    
    
      <link rel="stylesheet" href="../../../stylesheets/note.css">
    
    <script>__md_scope=new URL("../../..",location),__md_hash=e=>[...e].reduce((e,_)=>(e<<5)-e+_.charCodeAt(0),0),__md_get=(e,_=localStorage,t=__md_scope)=>JSON.parse(_.getItem(t.pathname+"."+e)),__md_set=(e,_,t=localStorage,a=__md_scope)=>{try{t.setItem(a.pathname+"."+e,JSON.stringify(_))}catch(e){}}</script>
    
      

    
    
    
  </head>
  
  
    
    
      
    
    
    
    
    <body dir="ltr" data-md-color-scheme="nebula" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    
    
      <script>var palette=__md_get("__palette");if(palette&&"object"==typeof palette.color)for(var key of Object.keys(palette.color))document.body.setAttribute("data-md-color-"+key,palette.color[key])</script>
    
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" for="__drawer"></label>
    <div data-md-component="skip">
      
        
        <a href="#schema-related_functions" class="md-skip">
          Skip to content
        </a>
      
    </div>
    <div data-md-component="announce">
      
        <aside class="md-banner">
          <div class="md-banner__inner md-grid md-typeset">
            
            
Insider: Document versions starting from 3.6.0 contain Community Edition features only. For Enterprise documentation, please <a href="https://yueshu.com.cn/contact">Contact us</a>. <a href="../../../.."> 
  <strong>Click here to go to latest.</strong>
</a>


          </div>
          
        </aside>
      
    </div>
    
      <div data-md-color-scheme="default" data-md-component="outdated" hidden>
        
          <aside class="md-banner md-banner--warning">
            <div class="md-banner__inner md-grid md-typeset">
              
  Insider: You're not viewing the latest version.
  <a href="../../../.."> 
    <strong>Click here to go to latest.</strong>
  </a>

            </div>
            <script>var el=document.querySelector("[data-md-component=outdated]"),outdated=__md_get("__outdated",sessionStorage);!0===outdated&&el&&(el.hidden=!1)</script>
          </aside>
        
      </div>
    
    
      

  

<header class="md-header md-header--shadow md-header--lifted" data-md-component="header">
  <nav class="md-header__inner md-grid" aria-label="Header">
    <a href="../../.." title="Chris Docs" class="md-header__button md-logo" aria-label="Chris Docs" data-md-component="logo">
      
  <img src="https://docs-cdn.nebula-graph.com.cn/figures/vesoft-nebula-logo-white22-12-21.png" alt="logo">

    </a>
    <label class="md-header__button md-icon" for="__drawer">
      
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M3 6h18v2H3V6m0 5h18v2H3v-2m0 5h18v2H3v-2Z"/></svg>
    </label>
    <div class="md-header__title" data-md-component="header-title">
      <div class="md-header__ellipsis">
        <div class="md-header__topic">
          <span class="md-ellipsis">
            Chris Docs
          </span>
        </div>
        <div class="md-header__topic" data-md-component="header-topic">
          <span class="md-ellipsis">
            
              Schema-related functions
            
          </span>
        </div>
      </div>
    </div>
    
      
        <form class="md-header__option" data-md-component="palette">
  
    
    
    
    <input class="md-option" data-md-color-media="" data-md-color-scheme="nebula" data-md-color-primary="indigo" data-md-color-accent="indigo"  aria-label="Switch to dark mode"  type="radio" name="__palette" id="__palette_1">
    
      <label class="md-header__button md-icon" title="Switch to dark mode" for="__palette_2" hidden>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M17 6H7c-3.31 0-6 2.69-6 6s2.69 6 6 6h10c3.31 0 6-2.69 6-6s-2.69-6-6-6zm0 10H7c-2.21 0-4-1.79-4-4s1.79-4 4-4h10c2.21 0 4 1.79 4 4s-1.79 4-4 4zM7 9c-1.66 0-3 1.34-3 3s1.34 3 3 3 3-1.34 3-3-1.34-3-3-3z"/></svg>
      </label>
    
  
    
    
    
    <input class="md-option" data-md-color-media="" data-md-color-scheme="slate" data-md-color-primary="indigo" data-md-color-accent="indigo"  aria-label="Switch to light mode"  type="radio" name="__palette" id="__palette_2">
    
      <label class="md-header__button md-icon" title="Switch to light mode" for="__palette_1" hidden>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M17 7H7a5 5 0 0 0-5 5 5 5 0 0 0 5 5h10a5 5 0 0 0 5-5 5 5 0 0 0-5-5m0 8a3 3 0 0 1-3-3 3 3 0 0 1 3-3 3 3 0 0 1 3 3 3 3 0 0 1-3 3Z"/></svg>
      </label>
    
  
</form>
      
    
    
    
      <label class="md-header__button md-icon" for="__search">
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5Z"/></svg>
      </label>
      <div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" aria-label="Search" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="search-query" required>
      <label class="md-search__icon md-icon" for="__search">
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5Z"/></svg>
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12Z"/></svg>
      </label>
      <nav class="md-search__options" aria-label="Search">
        
        <button type="reset" class="md-search__icon md-icon" title="Clear" aria-label="Clear" tabindex="-1">
          
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M19 6.41 17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41Z"/></svg>
        </button>
      </nav>
      
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="search-result">
          <div class="md-search-result__meta">
            Initializing search
          </div>
          <ol class="md-search-result__list" role="presentation"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
    
    
      <div class="md-header__source">
        <a href="https://github.com/ChrisChen2023/multi_lang_test" title="Go to repository" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
  </div>
  <div class="md-source__repository">
    multi_lang_test
  </div>
</a>
      </div>
    
  </nav>
  
    
      
<nav class="md-tabs" aria-label="Tabs" data-md-component="tabs">
  <div class="md-grid">
    <ul class="md-tabs__list">
      
        
  
  
  
    <li class="md-tabs__item">
      <a href="../../.." class="md-tabs__link">
        
  
    
  
  Home

      </a>
    </li>
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-tabs__link">
          
  
  Introduction

        </a>
      </li>
    
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../2.quick-start/1.quick-start-workflow0/" class="md-tabs__link">
          
  
  Quick start

        </a>
      </li>
    
  

      
        
  
  
  
    
    
      
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../1.nGQL-overview/1.overview/" class="md-tabs__link">
          
  
  nGQL guide

        </a>
      </li>
    
  

    
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../nebula-dashboard/1.what-is-dashboard/" class="md-tabs__link">
          
  
  Dashboard (Community)

        </a>
      </li>
    
  

      
    </ul>
  </div>
</nav>
    
  
</header>
    
    <div class="md-container" data-md-component="container">
      
      
        
      
      <main class="md-main" data-md-component="main">
        <div class="md-main__inner md-grid">
          
            
              
              <div class="md-sidebar md-sidebar--primary" data-md-component="sidebar" data-md-type="navigation" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    


  


<nav class="md-nav md-nav--primary md-nav--lifted" aria-label="Navigation" data-md-level="0">
  <label class="md-nav__title" for="__drawer">
    <a href="../../.." title="Chris Docs" class="md-nav__button md-logo" aria-label="Chris Docs" data-md-component="logo">
      
  <img src="https://docs-cdn.nebula-graph.com.cn/figures/vesoft-nebula-logo-white22-12-21.png" alt="logo">

    </a>
    Chris Docs
  </label>
  
    <div class="md-nav__source">
      <a href="https://github.com/ChrisChen2023/multi_lang_test" title="Go to repository" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
  </div>
  <div class="md-source__repository">
    multi_lang_test
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
  
  
  
    <li class="md-nav__item">
      <a href="../../.." class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Home
  </span>
  

      </a>
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_2" >
        
          
          <label class="md-nav__link" for="__nav_2" id="__nav_2_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Introduction
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_2_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_2">
            <span class="md-nav__icon md-icon"></span>
            Introduction
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    What is NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.data-model/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Data model
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.1.path/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Path
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.vid/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    VID
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_2_5" >
        
          
          <label class="md-nav__link" for="__nav_2_5" id="__nav_2_5_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    NebulaGraph architecture
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_2_5_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_2_5">
            <span class="md-nav__icon md-icon"></span>
            NebulaGraph architecture
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Architecture overview
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Meta Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Graph Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Storage Service
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_3" >
        
          
          <label class="md-nav__link" for="__nav_3" id="__nav_3_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Quick start
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_3_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_3">
            <span class="md-nav__icon md-icon"></span>
            Quick start
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/1.quick-start-workflow0/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Deploy NebulaGraph using Docker
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_3_2" >
        
          
          <label class="md-nav__link" for="__nav_3_2" id="__nav_3_2_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    Deploy NebulaGraph on-premise
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_3_2_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_3_2">
            <span class="md-nav__icon md-icon"></span>
            Deploy NebulaGraph on-premise
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/2.install-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 1 Install NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/5.start-stop-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 2 Manage NebulaGraph Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.connect-to-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 3 Connect to NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.1add-storage-hosts/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 4 Register the Storage Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/4.nebula-graph-crud/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 5 Use nGQL (CRUD)
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/6.cheatsheet-for-ngql/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    nGQL cheatsheet
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_4" >
        
          
          <label class="md-nav__link" for="__nav_4" id="__nav_4_label" tabindex="">
            
  
  <span class="md-ellipsis">
    nGQL guide
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_4_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_4">
            <span class="md-nav__icon md-icon"></span>
            nGQL guide
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_4_1" >
        
          
          <label class="md-nav__link" for="__nav_4_1" id="__nav_4_1_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    nGQL overview
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_4_1_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_4_1">
            <span class="md-nav__icon md-icon"></span>
            nGQL overview
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/1.overview/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Overview
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/3.graph-patterns/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Graph patterns
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/comments/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Comments
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/identifier-case-sensitivity/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Identifier case sensitivity
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/keywords-and-reserved-words/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Keywords
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/ngql-style-guide/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    nGQL style guide
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_5" >
        
          
          <label class="md-nav__link" for="__nav_5" id="__nav_5_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Dashboard (Community)
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_5_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_5">
            <span class="md-nav__icon md-icon"></span>
            Dashboard (Community)
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/1.what-is-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    What is NebulaGraph Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/2.deploy-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Deploy Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/3.connect-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Connect to Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/4.use-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Use Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/6.monitor-parameter/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Monitoring metrics
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              
              <div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    

<nav class="md-nav md-nav--secondary" aria-label="Table of contents">
  
  
  
    
  
  
    <label class="md-nav__title" for="__toc">
      <span class="md-nav__icon md-icon"></span>
      Table of contents
    </label>
    <ul class="md-nav__list" data-md-component="toc" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#for_ngql_statements" class="md-nav__link">
    For nGQL statements
  </a>
  
    <nav class="md-nav" aria-label="For nGQL statements">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#idvertex" class="md-nav__link">
    id(vertex)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#propertiesvertex" class="md-nav__link">
    properties(vertex)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#propertiesedge" class="md-nav__link">
    properties(edge)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#typeedge" class="md-nav__link">
    type(edge)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#srcedge" class="md-nav__link">
    src(edge)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#dstedge" class="md-nav__link">
    dst(edge)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#rankedge" class="md-nav__link">
    rank(edge)
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#vertex" class="md-nav__link">
    vertex
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#edge" class="md-nav__link">
    edge
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#vertices" class="md-nav__link">
    vertices
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#edges" class="md-nav__link">
    edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#path" class="md-nav__link">
    path
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#for_statements_compatible_with_opencypher" class="md-nav__link">
    For statements compatible with openCypher
  </a>
  
    <nav class="md-nav" aria-label="For statements compatible with openCypher">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#id" class="md-nav__link">
    id()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#tags_and_labels" class="md-nav__link">
    tags() and labels()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#properties" class="md-nav__link">
    properties()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#type" class="md-nav__link">
    type()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#typeid" class="md-nav__link">
    typeid()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#src" class="md-nav__link">
    src()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#dst" class="md-nav__link">
    dst()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#startnode" class="md-nav__link">
    startNode()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#endnode" class="md-nav__link">
    endNode()
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#rank" class="md-nav__link">
    rank()
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          
            <div class="md-content" data-md-component="content">
              <article class="md-content__inner md-typeset">
                
                  

  
  


<h1 id="schema-related_functions">Schema-related functions<a class="headerlink" href="#schema-related_functions" title="Permanent link">&para;</a></h1>
<p>This topic describes the schema-related functions supported by NebulaGraph. There are two types of schema-related functions, one for native nGQL statements and the other for openCypher-compatible statements.</p>
<h2 id="for_ngql_statements">For nGQL statements<a class="headerlink" href="#for_ngql_statements" title="Permanent link">&para;</a></h2>
<p>The following functions are available in <code>YIELD</code> and <code>WHERE</code> clauses of nGQL statements.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>Since vertex, edge, vertices, edges, and path are keywords, you need to use <code>AS &lt;alias&gt;</code> to set the alias, such as <code>GO FROM "player100" OVER follow YIELD edge AS e;</code>.</p>
</div>
<h3 id="idvertex">id(vertex)<a class="headerlink" href="#idvertex" title="Permanent link">&para;</a></h3>
<p>id(vertex) returns the ID of a vertex.</p>
<p>Syntax: <code>id(vertex)</code></p>
<ul>
<li>Result type: Same as the vertex ID.</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; LOOKUP ON player WHERE player.age  &gt; 45 YIELD id(vertex);
+-------------+
| id(VERTEX)  |
+-------------+
| &quot;player144&quot; |
| &quot;player140&quot; |
+-------------+
</code></pre></div>
<h3 id="propertiesvertex">properties(vertex)<a class="headerlink" href="#propertiesvertex" title="Permanent link">&para;</a></h3>
<p>properties(vertex) returns the properties of a vertex.</p>
<p>Syntax: <code>properties(vertex)</code></p>
<ul>
<li>Result type: Map</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; LOOKUP ON player WHERE player.age  &gt; 45 \
        YIELD properties(vertex);
+-------------------------------------+
| properties(VERTEX)                  |
+-------------------------------------+
| {age: 47, name: &quot;Shaquille O&#39;Neal&quot;} |
| {age: 46, name: &quot;Grant Hill&quot;}       |
+-------------------------------------+
</code></pre></div>
<p>You can also use the property reference symbols (<code>$^</code> and <code>$$</code>) instead of the <code>vertex</code> field in the <code>properties()</code> function to get all properties of a vertex.</p>
<ul>
<li><code>$^</code> represents the data of the starting vertex at the beginning of exploration. For example, in <code>GO FROM "player100" OVER follow reversely YIELD properties($^)</code>, <code>$^</code> refers to the vertex <code>player100</code>.</li>
</ul>
<ul>
<li><code>$$</code> represents the data of the end vertex at the end of exploration.</li>
</ul>
<p><code>properties($^)</code> and <code>properties($$)</code> are generally used in <code>GO</code> statements. For more information, see <a href="../../5.operators/5.property-reference/">Property reference</a>.</p>
<div class="admonition caution">
<p class="admonition-title">Caution</p>
<p>You can use <code>properties().&lt;property_name&gt;</code> to get a specific property of a vertex. However, it is not recommended to use this method to obtain specific properties because the <code>properties()</code> function returns all properties, which can decrease query performance.</p>
</div>
<h3 id="propertiesedge">properties(edge)<a class="headerlink" href="#propertiesedge" title="Permanent link">&para;</a></h3>
<p>properties(edge) returns the properties of an edge.</p>
<p>Syntax: <code>properties(edge)</code></p>
<ul>
<li>Result type: Map</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow \
        YIELD properties(edge);
+------------------+
| properties(EDGE) |
+------------------+
| {degree: 95}     |
| {degree: 95}     |
+------------------+
</code></pre></div>
<div class="admonition caution">
<p class="admonition-title">Caution</p>
<p>You can use <code>properties(edge).&lt;property_name&gt;</code> to get a specific property of an edge. However, it is not recommended to use this method to obtain specific properties because the <code>properties(edge)</code> function returns all properties, which can decrease query performance.</p>
</div>
<h3 id="typeedge">type(edge)<a class="headerlink" href="#typeedge" title="Permanent link">&para;</a></h3>
<p>type(edge) returns the edge type of an edge.</p>
<p>Syntax: <code>type(edge)</code></p>
<ul>
<li>Result type: String</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow \
        YIELD src(edge), dst(edge), type(edge), rank(edge);
+-------------+-------------+------------+------------+
| src(EDGE)   | dst(EDGE)   | type(EDGE) | rank(EDGE) |
+-------------+-------------+------------+------------+
| &quot;player100&quot; | &quot;player101&quot; | &quot;follow&quot;   | 0          |
| &quot;player100&quot; | &quot;player125&quot; | &quot;follow&quot;   | 0          |
+-------------+-------------+------------+------------+
</code></pre></div>
<h3 id="srcedge">src(edge)<a class="headerlink" href="#srcedge" title="Permanent link">&para;</a></h3>
<p>src(edge) returns the source vertex ID of an edge.</p>
<p>Syntax: <code>src(edge)</code></p>
<ul>
<li>Result type: Same as the vertex ID.</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow \
        YIELD src(edge), dst(edge);
+-------------+-------------+
| src(EDGE)   | dst(EDGE)   |
+-------------+-------------+
| &quot;player100&quot; | &quot;player101&quot; |
| &quot;player100&quot; | &quot;player125&quot; |
+-------------+-------------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>The semantics of the query for the starting vertex with src(edge) and <a href="../../5.operators/5.property-reference/">properties(<code>$^</code>)</a> are different. src(edge) indicates the starting vertex ID of the edge in the graph database, while properties(<code>$^</code>) indicates the data of the starting vertex where you start to expand the graph, such as the data of the starting vertex <code>player100</code> in the above GO statement. </p>
</div>
<h3 id="dstedge">dst(edge)<a class="headerlink" href="#dstedge" title="Permanent link">&para;</a></h3>
<p>dst(edge) returns the destination vertex ID of an edge.</p>
<p>Syntax: <code>dst(edge)</code></p>
<ul>
<li>Result type: Same as the vertex ID.</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow \
        YIELD src(edge), dst(edge);
+-------------+-------------+
| src(EDGE)   | dst(EDGE)   |
+-------------+-------------+
| &quot;player100&quot; | &quot;player101&quot; |
| &quot;player100&quot; | &quot;player125&quot; |
+-------------+-------------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>dst(edge) indicates the destination vertex ID of the edge in the graph database.</p>
</div>
<h3 id="rankedge">rank(edge)<a class="headerlink" href="#rankedge" title="Permanent link">&para;</a></h3>
<p>rank(edge) returns the rank value of an edge.</p>
<p>Syntax: <code>rank(edge)</code></p>
<ul>
<li>Result type: Int</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow \
        YIELD src(edge), dst(edge), rank(edge);
+-------------+-------------+------------+
| src(EDGE)   | dst(EDGE)   | rank(EDGE) |
+-------------+-------------+------------+
| &quot;player100&quot; | &quot;player101&quot; | 0          |
| &quot;player100&quot; | &quot;player125&quot; | 0          |
+-------------+-------------+------------+
</code></pre></div>
<h3 id="vertex">vertex<a class="headerlink" href="#vertex" title="Permanent link">&para;</a></h3>
<p>vertex returns the information of vertices, including VIDs, tags, properties, and values. You need to use <code>AS &lt;alias&gt;</code> to set the alias.</p>
<p>Syntax: <code>vertex</code></p>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; LOOKUP ON player WHERE player.age &gt; 45 YIELD vertex AS v;
+----------------------------------------------------------+
| v                                                        |
+----------------------------------------------------------+
| (&quot;player144&quot; :player{age: 47, name: &quot;Shaquille O&#39;Neal&quot;}) |
| (&quot;player140&quot; :player{age: 46, name: &quot;Grant Hill&quot;})       |
+----------------------------------------------------------+
</code></pre></div>
<h3 id="edge">edge<a class="headerlink" href="#edge" title="Permanent link">&para;</a></h3>
<p>edge returns the information of edges, including edge types, source vertices, destination vertices, ranks, properties, and values. You need to use <code>AS &lt;alias&gt;</code> to set the alias.</p>
<p>Syntax: <code>edge</code></p>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow YIELD edge AS e;
+----------------------------------------------------+
| e                                                  |
+----------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}] |
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}] |
+----------------------------------------------------+
</code></pre></div>
<h3 id="vertices">vertices<a class="headerlink" href="#vertices" title="Permanent link">&para;</a></h3>
<p>vertices returns the information of vertices in a subgraph. For more information, see <a href="../../16.subgraph-and-path/1.get-subgraph/">GET SUBGRAPH</a>.</p>
<h3 id="edges">edges<a class="headerlink" href="#edges" title="Permanent link">&para;</a></h3>
<p>edges returns the information of edges in a subgraph. For more information, see <a href="../../16.subgraph-and-path/1.get-subgraph/">GET SUBGRAPH</a>.</p>
<h3 id="path">path<a class="headerlink" href="#path" title="Permanent link">&para;</a></h3>
<p>path returns the information of a path. For more information, see <a href="../../16.subgraph-and-path/2.find-path/">FIND PATH</a>.</p>
<h2 id="for_statements_compatible_with_opencypher">For statements compatible with openCypher<a class="headerlink" href="#for_statements_compatible_with_opencypher" title="Permanent link">&para;</a></h2>
<p>The following functions are available in <code>RETURN</code> and <code>WHERE</code> clauses of openCypher-compatible statements.</p>
<h3 id="id">id()<a class="headerlink" href="#id" title="Permanent link">&para;</a></h3>
<p>id() returns the ID of a vertex.</p>
<p>Syntax: <code>id(&lt;vertex&gt;)</code></p>
<ul>
<li>Result type: Same as the vertex ID.</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) RETURN id(v); 
+-------------+
| id(v)       |
+-------------+
| &quot;player129&quot; |
| &quot;player115&quot; |
| &quot;player106&quot; |
| &quot;player102&quot; |
...
</code></pre></div>
<h3 id="tags_and_labels">tags() and labels()<a class="headerlink" href="#tags_and_labels" title="Permanent link">&para;</a></h3>
<p>tags() and labels() return the Tag of a vertex.</p>
<p>Syntax: <code>tags(&lt;vertex&gt;)</code>, <code>labels(&lt;vertex&gt;)</code></p>
<ul>
<li>Result type: List</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) WHERE id(v) == &quot;player100&quot; \
        RETURN tags(v);
+------------+
| tags(v)    |
+------------+
| [&quot;player&quot;] |
+------------+
</code></pre></div>
<h3 id="properties">properties()<a class="headerlink" href="#properties" title="Permanent link">&para;</a></h3>
<p>properties() returns the properties of a vertex or an edge.</p>
<p>Syntax: <code>properties(&lt;vertex_or_edge&gt;)</code></p>
<ul>
<li>Result type: Map</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player)-[e:follow]-() RETURN properties(v),properties(e);
+---------------------------------------+---------------+
| properties(v)                         | properties(e) |
+---------------------------------------+---------------+
| {age: 31, name: &quot;Stephen Curry&quot;}      | {degree: 90}  |
| {age: 47, name: &quot;Shaquille O&#39;Neal&quot;}   | {degree: 100} |
| {age: 34, name: &quot;LeBron James&quot;}       | {degree: 13}  |
...
</code></pre></div>
<h3 id="type">type()<a class="headerlink" href="#type" title="Permanent link">&para;</a></h3>
<p>type() returns the edge type of an edge.</p>
<p>Syntax: <code>type(&lt;edge&gt;)</code></p>
<ul>
<li>Result type: String</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;() \
        RETURN type(e);
+----------+
| type(e)  |
+----------+
| &quot;serve&quot;  |
| &quot;follow&quot; |
| &quot;follow&quot; |
+----------+
</code></pre></div>
<h3 id="typeid">typeid()<a class="headerlink" href="#typeid" title="Permanent link">&para;</a></h3>
<p>typeid() returns the internal ID value of the Edge type of the edge, which can be used to determine the direction by positive or negative.</p>
<p>Syntax: <code>typeid(&lt;edge&gt;)</code></p>
<ul>
<li>Result type: Int</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player)-[e:follow]-(v2) RETURN e,typeid(e), \
        CASE WHEN typeid(e) &gt; 0 \
        THEN &quot;Forward&quot; ELSE &quot;Reverse&quot; END AS direction \
        LIMIT 5;
+----------------------------------------------------+-----------+-----------+
| e                                                  | typeid(e) | direction |
+----------------------------------------------------+-----------+-----------+
| [:follow &quot;player127&quot;-&gt;&quot;player114&quot; @0 {degree: 90}] | 5         | &quot;Forward&quot; |
| [:follow &quot;player127&quot;-&gt;&quot;player148&quot; @0 {degree: 70}] | 5         | &quot;Forward&quot; |
| [:follow &quot;player148&quot;-&gt;&quot;player127&quot; @0 {degree: 80}] | -5        | &quot;Reverse&quot; |
| [:follow &quot;player147&quot;-&gt;&quot;player136&quot; @0 {degree: 90}] | 5         | &quot;Forward&quot; |
| [:follow &quot;player136&quot;-&gt;&quot;player147&quot; @0 {degree: 90}] | -5        | &quot;Reverse&quot; |
+----------------------------------------------------+-----------+-----------+
</code></pre></div>
<h3 id="src">src()<a class="headerlink" href="#src" title="Permanent link">&para;</a></h3>
<p>src() returns the source vertex ID of an edge.</p>
<p>Syntax: <code>src(&lt;edge&gt;)</code></p>
<ul>
<li>Result type: Same as the vertex ID.</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH ()-[e]-&gt;(v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN src(e);
+-------------+
| src(e)      |
+-------------+
| &quot;player125&quot; |
| &quot;player113&quot; |
| &quot;player102&quot; |
...
</code></pre></div>
<h3 id="dst">dst()<a class="headerlink" href="#dst" title="Permanent link">&para;</a></h3>
<p>dst() returns the destination vertex ID of an edge.</p>
<p>Syntax: <code>dst(&lt;edge&gt;)</code></p>
<ul>
<li>Result type: Same as the vertex ID.</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;() \
        RETURN dst(e);
+-------------+
| dst(e)      |
+-------------+
| &quot;team204&quot;   |
| &quot;player101&quot; |
| &quot;player125&quot; |
+-------------+
</code></pre></div>
<h3 id="startnode">startNode()<a class="headerlink" href="#startnode" title="Permanent link">&para;</a></h3>
<p>startNode() visits a path and returns its information of source vertex ID, including VIDs, tags, properties, and values.</p>
<p>Syntax: <code>startNode(&lt;path&gt;)</code></p>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p = (a :player {name : &quot;Tim Duncan&quot;})-[r:serve]-(t) \
        RETURN startNode(p);
+----------------------------------------------------+
| startNode(p)                                       |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+
</code></pre></div>
<h3 id="endnode">endNode()<a class="headerlink" href="#endnode" title="Permanent link">&para;</a></h3>
<p>endNode() visits a path and returns its information of destination vertex ID, including VIDs, tags, properties, and values.</p>
<p>Syntax: <code>endNode(&lt;path&gt;)</code></p>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p = (a :player {name : &quot;Tim Duncan&quot;})-[r:serve]-(t) \
        RETURN endNode(p);
+----------------------------------+
| endNode(p)                       |
+----------------------------------+
| (&quot;team204&quot; :team{name: &quot;Spurs&quot;}) |
+----------------------------------+
</code></pre></div>
<h3 id="rank">rank()<a class="headerlink" href="#rank" title="Permanent link">&para;</a></h3>
<p>rank() returns the rank value of an edge.</p>
<p>Syntax: <code>rank(&lt;edge&gt;)</code></p>
<ul>
<li>Result type: Int</li>
</ul>
<p>Example:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;() \
        RETURN rank(e);
+---------+
| rank(e) |
+---------+
| 0       |
| 0       |
| 0       |
+---------+
</code></pre></div>





                
              </article>
            </div>
          
          
        </div>
        
      </main>
      
        <footer class="md-footer">
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-copyright">
  
  
    Made with
    <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
      Material for MkDocs
    </a>
  
</div>
      
        <div class="md-social">
  
    
    
    
    
      
      
    
    <a href="https://github.com/vesoft-inc/nebula-docs-cn" target="_blank" rel="noopener" title="github.com" class="md-social__link">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
    </a>
  
</div>
      
    </div>
  </div>
</footer>
      
    </div>
    <div class="md-dialog" data-md-component="dialog">
      <div class="md-dialog__inner md-typeset"></div>
    </div>
    
    
    <script id="__config" type="application/json">{"base": "../../..", "features": ["navigation.tabs", "navigation.tabs.sticky"], "search": "../../../assets/javascripts/workers/search.f886a092.min.js", "translations": {"clipboard.copied": "Copied to clipboard", "clipboard.copy": "Copy to clipboard", "search.result.more.one": "1 more on this page", "search.result.more.other": "# more on this page", "search.result.none": "No matching documents", "search.result.one": "1 matching document", "search.result.other": "# matching documents", "search.result.placeholder": "Type to start searching", "search.result.term.missing": "Missing", "select.version": "Select version"}, "version": {"provider": "mike"}}</script>
    
    
      <script src="../../../assets/javascripts/bundle.aecac24b.min.js"></script>
      
    
  </body>
</html>