
<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
      
      
        <link rel="canonical" href="https://chrischen2023.github.io/multi_lang_test/main/3.ngql-guide/7.general-query-statements/3.go/">
      
      
      
      
      <link rel="icon" href="https://docs-cdn.nebula-graph.com.cn/figures/favicon.ico">
      <meta name="generator" content="mkdocs-1.5.3, mkdocs-material-9.4.6">
    
    
      
        <title>GO - Chris Docs</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/main.35e1ed30.min.css">
      
        
        <link rel="stylesheet" href="../../../assets/stylesheets/palette.356b1318.min.css">
      
      


    
    
      
    
    
      
        
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,300i,400,400i,700,700i%7CRoboto+Mono:400,400i,700,700i&display=fallback">
        <style>:root{--md-text-font:"Roboto";--md-code-font:"Roboto Mono"}</style>
      
    
    
      <link rel="stylesheet" href="../../../stylesheets/note.css">
    
    <script>__md_scope=new URL("../../..",location),__md_hash=e=>[...e].reduce((e,_)=>(e<<5)-e+_.charCodeAt(0),0),__md_get=(e,_=localStorage,t=__md_scope)=>JSON.parse(_.getItem(t.pathname+"."+e)),__md_set=(e,_,t=localStorage,a=__md_scope)=>{try{t.setItem(a.pathname+"."+e,JSON.stringify(_))}catch(e){}}</script>
    
      

    
    
    
  </head>
  
  
    
    
      
    
    
    
    
    <body dir="ltr" data-md-color-scheme="nebula" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    
    
      <script>var palette=__md_get("__palette");if(palette&&"object"==typeof palette.color)for(var key of Object.keys(palette.color))document.body.setAttribute("data-md-color-"+key,palette.color[key])</script>
    
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" for="__drawer"></label>
    <div data-md-component="skip">
      
        
        <a href="#go" class="md-skip">
          Skip to content
        </a>
      
    </div>
    <div data-md-component="announce">
      
        <aside class="md-banner">
          <div class="md-banner__inner md-grid md-typeset">
            
            
Insider: Document versions starting from 3.6.0 contain Community Edition features only. For Enterprise documentation, please <a href="https://yueshu.com.cn/contact">Contact us</a>. <a href="../../../.."> 
  <strong>Click here to go to latest.</strong>
</a>


          </div>
          
        </aside>
      
    </div>
    
      <div data-md-color-scheme="default" data-md-component="outdated" hidden>
        
          <aside class="md-banner md-banner--warning">
            <div class="md-banner__inner md-grid md-typeset">
              
  Insider: You're not viewing the latest version.
  <a href="../../../.."> 
    <strong>Click here to go to latest.</strong>
  </a>

            </div>
            <script>var el=document.querySelector("[data-md-component=outdated]"),outdated=__md_get("__outdated",sessionStorage);!0===outdated&&el&&(el.hidden=!1)</script>
          </aside>
        
      </div>
    
    
      

  

<header class="md-header md-header--shadow md-header--lifted" data-md-component="header">
  <nav class="md-header__inner md-grid" aria-label="Header">
    <a href="../../.." title="Chris Docs" class="md-header__button md-logo" aria-label="Chris Docs" data-md-component="logo">
      
  <img src="https://docs-cdn.nebula-graph.com.cn/figures/vesoft-nebula-logo-white22-12-21.png" alt="logo">

    </a>
    <label class="md-header__button md-icon" for="__drawer">
      
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M3 6h18v2H3V6m0 5h18v2H3v-2m0 5h18v2H3v-2Z"/></svg>
    </label>
    <div class="md-header__title" data-md-component="header-title">
      <div class="md-header__ellipsis">
        <div class="md-header__topic">
          <span class="md-ellipsis">
            Chris Docs
          </span>
        </div>
        <div class="md-header__topic" data-md-component="header-topic">
          <span class="md-ellipsis">
            
              GO
            
          </span>
        </div>
      </div>
    </div>
    
      
        <form class="md-header__option" data-md-component="palette">
  
    
    
    
    <input class="md-option" data-md-color-media="" data-md-color-scheme="nebula" data-md-color-primary="indigo" data-md-color-accent="indigo"  aria-label="Switch to dark mode"  type="radio" name="__palette" id="__palette_1">
    
      <label class="md-header__button md-icon" title="Switch to dark mode" for="__palette_2" hidden>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M17 6H7c-3.31 0-6 2.69-6 6s2.69 6 6 6h10c3.31 0 6-2.69 6-6s-2.69-6-6-6zm0 10H7c-2.21 0-4-1.79-4-4s1.79-4 4-4h10c2.21 0 4 1.79 4 4s-1.79 4-4 4zM7 9c-1.66 0-3 1.34-3 3s1.34 3 3 3 3-1.34 3-3-1.34-3-3-3z"/></svg>
      </label>
    
  
    
    
    
    <input class="md-option" data-md-color-media="" data-md-color-scheme="slate" data-md-color-primary="indigo" data-md-color-accent="indigo"  aria-label="Switch to light mode"  type="radio" name="__palette" id="__palette_2">
    
      <label class="md-header__button md-icon" title="Switch to light mode" for="__palette_1" hidden>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M17 7H7a5 5 0 0 0-5 5 5 5 0 0 0 5 5h10a5 5 0 0 0 5-5 5 5 0 0 0-5-5m0 8a3 3 0 0 1-3-3 3 3 0 0 1 3-3 3 3 0 0 1 3 3 3 3 0 0 1-3 3Z"/></svg>
      </label>
    
  
</form>
      
    
    
    
      <label class="md-header__button md-icon" for="__search">
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5Z"/></svg>
      </label>
      <div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" aria-label="Search" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="search-query" required>
      <label class="md-search__icon md-icon" for="__search">
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5Z"/></svg>
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12Z"/></svg>
      </label>
      <nav class="md-search__options" aria-label="Search">
        
        <button type="reset" class="md-search__icon md-icon" title="Clear" aria-label="Clear" tabindex="-1">
          
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M19 6.41 17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41Z"/></svg>
        </button>
      </nav>
      
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="search-result">
          <div class="md-search-result__meta">
            Initializing search
          </div>
          <ol class="md-search-result__list" role="presentation"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
    
    
      <div class="md-header__source">
        <a href="https://github.com/ChrisChen2023/multi_lang_test" title="Go to repository" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
  </div>
  <div class="md-source__repository">
    multi_lang_test
  </div>
</a>
      </div>
    
  </nav>
  
    
      
<nav class="md-tabs" aria-label="Tabs" data-md-component="tabs">
  <div class="md-grid">
    <ul class="md-tabs__list">
      
        
  
  
  
    <li class="md-tabs__item">
      <a href="../../.." class="md-tabs__link">
        
  
    
  
  Home

      </a>
    </li>
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-tabs__link">
          
  
  Introduction

        </a>
      </li>
    
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../2.quick-start/1.quick-start-workflow/" class="md-tabs__link">
          
  
  Quick start

        </a>
      </li>
    
  

      
        
  
  
  
    
    
      
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../1.nGQL-overview/1.overview/" class="md-tabs__link">
          
  
  nGQL guide

        </a>
      </li>
    
  

    
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../nebula-dashboard/1.what-is-dashboard/" class="md-tabs__link">
          
  
  Dashboard (Community)

        </a>
      </li>
    
  

      
    </ul>
  </div>
</nav>
    
  
</header>
    
    <div class="md-container" data-md-component="container">
      
      
        
      
      <main class="md-main" data-md-component="main">
        <div class="md-main__inner md-grid">
          
            
              
              <div class="md-sidebar md-sidebar--primary" data-md-component="sidebar" data-md-type="navigation" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    


  


<nav class="md-nav md-nav--primary md-nav--lifted" aria-label="Navigation" data-md-level="0">
  <label class="md-nav__title" for="__drawer">
    <a href="../../.." title="Chris Docs" class="md-nav__button md-logo" aria-label="Chris Docs" data-md-component="logo">
      
  <img src="https://docs-cdn.nebula-graph.com.cn/figures/vesoft-nebula-logo-white22-12-21.png" alt="logo">

    </a>
    Chris Docs
  </label>
  
    <div class="md-nav__source">
      <a href="https://github.com/ChrisChen2023/multi_lang_test" title="Go to repository" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
  </div>
  <div class="md-source__repository">
    multi_lang_test
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
  
  
  
    <li class="md-nav__item">
      <a href="../../.." class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Home
  </span>
  

      </a>
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_2" >
        
          
          <label class="md-nav__link" for="__nav_2" id="__nav_2_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Introduction
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_2_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_2">
            <span class="md-nav__icon md-icon"></span>
            Introduction
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    What is NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.data-model/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Data model
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.1.path/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Path
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.vid/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    VID
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_2_5" >
        
          
          <label class="md-nav__link" for="__nav_2_5" id="__nav_2_5_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    NebulaGraph architecture
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_2_5_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_2_5">
            <span class="md-nav__icon md-icon"></span>
            NebulaGraph architecture
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Architecture overview
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Meta Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Graph Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Storage Service
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_3" >
        
          
          <label class="md-nav__link" for="__nav_3" id="__nav_3_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Quick start
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_3_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_3">
            <span class="md-nav__icon md-icon"></span>
            Quick start
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/1.quick-start-workflow/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Deploy NebulaGraph using Docker
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_3_2" >
        
          
          <label class="md-nav__link" for="__nav_3_2" id="__nav_3_2_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    Deploy NebulaGraph on-premise
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_3_2_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_3_2">
            <span class="md-nav__icon md-icon"></span>
            Deploy NebulaGraph on-premise
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/2.install-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 1 Install NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/5.start-stop-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 2 Manage NebulaGraph Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.connect-to-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 3 Connect to NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.1add-storage-hosts/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 4 Register the Storage Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/4.nebula-graph-crud/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 5 Use nGQL (CRUD)
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/6.cheatsheet-for-ngql/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    nGQL cheatsheet
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_4" >
        
          
          <label class="md-nav__link" for="__nav_4" id="__nav_4_label" tabindex="">
            
  
  <span class="md-ellipsis">
    nGQL guide
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_4_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_4">
            <span class="md-nav__icon md-icon"></span>
            nGQL guide
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_4_1" >
        
          
          <label class="md-nav__link" for="__nav_4_1" id="__nav_4_1_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    nGQL overview
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_4_1_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_4_1">
            <span class="md-nav__icon md-icon"></span>
            nGQL overview
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/1.overview/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Overview
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/3.graph-patterns/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Graph patterns
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/comments/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Comments
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/identifier-case-sensitivity/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Identifier case sensitivity
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/keywords-and-reserved-words/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Keywords
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/ngql-style-guide/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    nGQL style guide
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_5" >
        
          
          <label class="md-nav__link" for="__nav_5" id="__nav_5_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Dashboard (Community)
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_5_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_5">
            <span class="md-nav__icon md-icon"></span>
            Dashboard (Community)
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/1.what-is-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    What is NebulaGraph Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/2.deploy-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Deploy Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/3.connect-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Connect to Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/4.use-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Use Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/6.monitor-parameter/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Monitoring metrics
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              
              <div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    

<nav class="md-nav md-nav--secondary" aria-label="Table of contents">
  
  
  
    
  
  
    <label class="md-nav__title" for="__toc">
      <span class="md-nav__icon md-icon"></span>
      Table of contents
    </label>
    <ul class="md-nav__list" data-md-component="toc" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#opencypher_compatibility" class="md-nav__link">
    OpenCypher compatibility
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#syntax" class="md-nav__link">
    Syntax
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#notes" class="md-nav__link">
    Notes
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#cases_and_examples" class="md-nav__link">
    Cases and examples
  </a>
  
    <nav class="md-nav" aria-label="Cases and examples">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#to_query_the_immediate_neighbors_of_a_vertex" class="md-nav__link">
    To query the immediate neighbors of a vertex
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_query_all_vertices_within_a_specified_number_of_hops_from_a_starting_vertex" class="md-nav__link">
    To query all vertices within a specified number of hops from a starting vertex
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_add_filtering_conditions" class="md-nav__link">
    To add filtering conditions
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_query_multiple_edge_types" class="md-nav__link">
    To query multiple edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_query_incoming_vertices_using_the_reversely_keyword" class="md-nav__link">
    To query incoming vertices using the REVERSELY keyword
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_use_subqueries_as_the_starting_vertice_of_a_graph_traversal" class="md-nav__link">
    To use subqueries as the starting vertice of a graph traversal
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_use_group_by_to_group_the_output" class="md-nav__link">
    To use GROUP BY to group the output
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#to_use_order_by_and_limit_to_sort_and_limit_the_output" class="md-nav__link">
    To use ORDER BY and LIMIT to sort and limit the output
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#other_examples" class="md-nav__link">
    Other examples
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          
            <div class="md-content" data-md-component="content">
              <article class="md-content__inner md-typeset">
                
                  

  
  


<h1 id="go">GO<a class="headerlink" href="#go" title="Permanent link">&para;</a></h1>
<p>The <code>GO</code> statement is used in the NebulaGraph database to traverse the graph starting from a given starting vertex with specified filters and return results.</p>
<h2 id="opencypher_compatibility">OpenCypher compatibility<a class="headerlink" href="#opencypher_compatibility" title="Permanent link">&para;</a></h2>
<p>This topic applies to native nGQL only.</p>
<h2 id="syntax">Syntax<a class="headerlink" href="#syntax" title="Permanent link">&para;</a></h2>
<div class="highlight"><pre><span></span><code>GO [[&lt;M&gt; TO] &lt;N&gt; {STEP|STEPS}] FROM &lt;vertex_list&gt;
OVER &lt;edge_type_list&gt; [{REVERSELY | BIDIRECT}]
[ WHERE &lt;conditions&gt; ]
YIELD [DISTINCT] &lt;return_list&gt;
[{SAMPLE &lt;sample_list&gt; | &lt;limit_by_list_clause&gt;}]
[| GROUP BY {col_name | expr | position} YIELD &lt;col_name&gt;]
[| ORDER BY &lt;expression&gt; [{ASC | DESC}]]
[| LIMIT [&lt;offset&gt;,] &lt;number_rows&gt;];

&lt;vertex_list&gt; ::=
    &lt;vid&gt; [, &lt;vid&gt; ...]

&lt;edge_type_list&gt; ::=
   edge_type [, edge_type ...]
   | *

&lt;return_list&gt; ::=
    &lt;col_name&gt; [AS &lt;col_alias&gt;] [, &lt;col_name&gt; [AS &lt;col_alias&gt;] ...]
</code></pre></div>
<ul>
<li>
<p><code>&lt;N&gt; {STEP|STEPS}</code>: specifies the hop number. If not specified, the default value for <code>N</code> is <code>one</code>. When <code>N</code> is <code>zero</code>, NebulaGraph does not traverse any edges and returns nothing.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>The path type of the <code>GO</code> statement is <code>walk</code>, which means both vertices and edges can be repeatedly visited in graph traversal. For more information, see <a href="../../../1.introduction/2.1.path/">Path</a>.</p>
</div>
</li>
</ul>
<ul>
<li><code>M TO N {STEP|STEPS}</code>: traverses <code>from M to N</code> hops. When <code>M</code> is <code>zero</code>, the output is the same as that of <code>M</code> is <code>one</code>. That is, the output of <code>GO 0 TO 2</code> and <code>GO 1 TO 2</code> are the same.</li>
</ul>
<ul>
<li><code>&lt;vertex_list&gt;</code>: represents a list of vertex IDs separated by commas.</li>
</ul>
<ul>
<li><code>&lt;edge_type_list&gt;</code>: represents a list of edge types which the traversal can go through.</li>
</ul>
<ul>
<li><code>REVERSELY | BIDIRECT</code>: defines the direction of the query. By default, the <code>GO</code> statement searches for outgoing edges of <code>&lt;vertex_list&gt;</code>. If <code>REVERSELY</code> is set, <code>GO</code> searches for incoming edges. If <code>BIDIRECT</code> is set, <code>GO</code> searches for edges of both directions. The direction of the query can be checked by returning the <code>&lt;edge_type&gt;._type</code> field using <code>YIELD</code>. A positive value indicates an outgoing edge, while a negative value indicates an incoming edge.</li>
</ul>
<ul>
<li>
<p><code>WHERE &lt;expression&gt;</code>: specifies the traversal filters. You can use the <code>WHERE</code> clause for the source vertices, the edges, and the destination vertices. You can use it together with <code>AND</code>, <code>OR</code>, <code>NOT</code>, and <code>XOR</code>. For more information, see <a href="../../8.clauses-and-options/where/">WHERE</a>.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<ul>
<li>There are some restrictions for the <code>WHERE</code> clause when you traverse along with multiple edge types. For example, <code>WHERE edge1.prop1 &gt; edge2.prop2</code> is not supported.</li>
<li>The GO statement is executed by traversing all the vertices and then filtering according to the filter condition.</li>
</ul>
</div>
</li>
</ul>
<ul>
<li><code>YIELD [DISTINCT] &lt;return_list&gt;</code>: defines the output to be returned. It is recommended to use the <a href="../../6.functions-and-expressions/4.schema/">Schema-related functions</a> to fill in <code>&lt;return_list&gt;</code>. <code>src(edge)</code>, <code>dst(edge)</code>, <code>type(edge) )</code>, <code>rank(edge)</code>, etc., are currently supported, while nested functions are not. For more information, see <a href="../../8.clauses-and-options/yield/">YIELD</a>.</li>
</ul>
<ul>
<li><code>SAMPLE &lt;sample_list&gt;</code>: takes samples from the result set. For more information, see <a href="../../8.clauses-and-options/sample/">SAMPLE</a>.</li>
</ul>
<ul>
<li><code>&lt;limit_by_list_clause&gt;</code>: limits the number of outputs during the traversal process. For more information, see <a href="../../8.clauses-and-options/limit/">LIMIT</a>.</li>
</ul>
<ul>
<li><code>GROUP BY</code>: groups the output into subgroups based on the value of the specified property. For more information, see <a href="../../8.clauses-and-options/group-by/">GROUP BY</a>. After grouping, you need to use <code>YIELD</code> again to define the output that needs to be returned.</li>
</ul>
<ul>
<li>
<p><code>ORDER BY</code>: sorts outputs with specified orders. For more information, see <a href="../../8.clauses-and-options/order-by/">ORDER BY</a>.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>When the sorting method is not specified, the output orders can be different for the same query.</p>
</div>
</li>
</ul>
<ul>
<li><code>LIMIT  [&lt;offset&gt;,] &lt;number_rows&gt;]</code>: limits the number of rows of the output. For more information, see <a href="../../8.clauses-and-options/limit/">LIMIT</a>.</li>
</ul>
<h2 id="notes">Notes<a class="headerlink" href="#notes" title="Permanent link">&para;</a></h2>
<ul>
<li>The <code>WHERE</code> and <code>YIELD</code> clauses in <code>GO</code> statements usually utilize property reference symbols (<code>$^</code> and <code>$$</code>) or the <code>properties($^)</code> and <code>properties($$)</code> functions to specify the properties of a vertex; use the <code>properties(edge)</code> function to specify the properties of an edge. For details, see <a href="../../4.variable-and-composite-queries/3.property-reference/">Property Reference Symbols</a> and <a href="../../6.functions-and-expressions/4.schema/">Schema-related Functions</a>.</li>
</ul>
<ul>
<li>When referring to the result of a subquery in a compound <code>GO</code> statement, you need to set a name for the result and pass it to the next subquery using the pipe symbol <code>|</code>, and reference the name of the result in the next subquery using <code>$-</code>. See the <a href="../../5.operators/4.pipe/">Pipe Operator</a> for details.</li>
</ul>
<ul>
<li>When the queried property has no value, the returned result displays <code>NULL</code>.</li>
</ul>
<h2 id="cases_and_examples">Cases and examples<a class="headerlink" href="#cases_and_examples" title="Permanent link">&para;</a></h2>
<h3 id="to_query_the_immediate_neighbors_of_a_vertex">To query the immediate neighbors of a vertex<a class="headerlink" href="#to_query_the_immediate_neighbors_of_a_vertex" title="Permanent link">&para;</a></h3>
<p>For example, to query the team that a person belongs to, assuming that the person is connected to the team by the <code>serve</code> edge and the person's ID is <code>player102</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player102&quot; OVER serve YIELD dst(edge);
+-----------+
| dst(EDGE) |
+-----------+
| &quot;team203&quot; |
| &quot;team204&quot; |
+-----------+
</code></pre></div>
<h3 id="to_query_all_vertices_within_a_specified_number_of_hops_from_a_starting_vertex">To query all vertices within a specified number of hops from a starting vertex<a class="headerlink" href="#to_query_all_vertices_within_a_specified_number_of_hops_from_a_starting_vertex" title="Permanent link">&para;</a></h3>
<p>For example, to query all vertices within two hops of a person vertex, assuming that the person is connected to other people by the <code>follow</code> edge and the person's ID is <code>player102</code>.</p>
<div class="highlight"><pre><span></span><code># Return all vertices that are 2 hops away from the player102 vertex.
nebula&gt; GO 2 STEPS FROM &quot;player102&quot; OVER follow YIELD dst(edge);
+-------------+
| dst(EDGE)   |
+-------------+
| &quot;player101&quot; |
| &quot;player125&quot; |
| &quot;player100&quot; |
| &quot;player102&quot; |
| &quot;player125&quot; |
+-------------+
</code></pre></div>
<div class="highlight"><pre><span></span><code># Return all vertices within 1 or 2 hops away from the player102 vertex.
nebula&gt; GO 1 TO 2 STEPS FROM &quot;player100&quot; OVER follow \
        YIELD dst(edge) AS destination;
+-------------+
| destination |
+-------------+
| &quot;player101&quot; |
| &quot;player125&quot; |
...

# The following MATCH query has the same semantics as the previous GO query.
nebula&gt; MATCH (v) -[e:follow*1..2]-&gt;(v2) \
        WHERE id(v) == &quot;player100&quot; \
        RETURN id(v2) AS destination;
+-------------+
| destination |
+-------------+
| &quot;player100&quot; |
| &quot;player102&quot; |
...
</code></pre></div>
<h3 id="to_add_filtering_conditions">To add filtering conditions<a class="headerlink" href="#to_add_filtering_conditions" title="Permanent link">&para;</a></h3>
<p>Case: To query the vertices and edges that meet specific conditions.</p>
<p>For example, use the <code>WHERE</code> clause to query the edges with specific properties between the starting vertex and the destination vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot;, &quot;player102&quot; OVER serve \
        WHERE properties(edge).start_year &gt; 1995 \
        YIELD DISTINCT properties($$).name AS team_name, properties(edge).start_year AS start_year, properties($^).name AS player_name;

+-----------------+------------+---------------------+
| team_name       | start_year | player_name         |
+-----------------+------------+---------------------+
| &quot;Spurs&quot;         | 1997       | &quot;Tim Duncan&quot;        |
| &quot;Trail Blazers&quot; | 2006       | &quot;LaMarcus Aldridge&quot; |
| &quot;Spurs&quot;         | 2015       | &quot;LaMarcus Aldridge&quot; |
+-----------------+------------+---------------------+
</code></pre></div>
<h3 id="to_query_multiple_edge_types">To query multiple edge types<a class="headerlink" href="#to_query_multiple_edge_types" title="Permanent link">&para;</a></h3>
<p>Case: To query multiple edge types that are connected to the starting vertex. You can specify multiple edge types or the <code>*</code> symbol to query multiple edge types.</p>
<p>For example, to query the <code>follow</code> and <code>serve</code> edges that are connected to the starting vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; GO FROM &quot;player100&quot; OVER follow, serve \
        YIELD properties(edge).degree, properties(edge).start_year;
+-------------------------+-----------------------------+
| properties(EDGE).degree | properties(EDGE).start_year |
+-------------------------+-----------------------------+
| 95                      | __NULL__                    |
| 95                      | __NULL__                    |
| __NULL__                | 1997                        |
+-------------------------+-----------------------------+
</code></pre></div>
<h3 id="to_query_incoming_vertices_using_the_reversely_keyword">To query incoming vertices using the REVERSELY keyword<a class="headerlink" href="#to_query_incoming_vertices_using_the_reversely_keyword" title="Permanent link">&para;</a></h3>
<div class="highlight"><pre><span></span><code># Return the vertices that follow the player100 vertex.
nebula&gt; GO FROM &quot;player100&quot; OVER follow REVERSELY \
        YIELD src(edge) AS destination;
+-------------+
| destination |
+-------------+
| &quot;player101&quot; |
| &quot;player102&quot; |
...

# The following MATCH query has the same semantics as the previous GO query.
nebula&gt; MATCH (v)&lt;-[e:follow]- (v2) WHERE id(v) == &#39;player100&#39; \
        RETURN id(v2) AS destination;
+-------------+
| destination |
+-------------+
| &quot;player101&quot; |
| &quot;player102&quot; |
...
</code></pre></div>
<h3 id="to_use_subqueries_as_the_starting_vertice_of_a_graph_traversal">To use subqueries as the starting vertice of a graph traversal<a class="headerlink" href="#to_use_subqueries_as_the_starting_vertice_of_a_graph_traversal" title="Permanent link">&para;</a></h3>
<div class="highlight"><pre><span></span><code># Return the friends of the player100 vertex and the teams that the friends belong to.
nebula&gt; GO FROM &quot;player100&quot; OVER follow REVERSELY \
        YIELD src(edge) AS id | \
        GO FROM $-.id OVER serve \
        WHERE properties($^).age &gt; 20 \
        YIELD properties($^).name AS FriendOf, properties($$).name AS Team;
+---------------------+-----------------+
| FriendOf            | Team            |
+---------------------+-----------------+
| &quot;Boris Diaw&quot;        | &quot;Spurs&quot;         |
| &quot;Boris Diaw&quot;        | &quot;Jazz&quot;          |
| &quot;Boris Diaw&quot;        | &quot;Suns&quot;          |
...

# The following MATCH query has the same semantics as the previous GO query.
nebula&gt; MATCH (v)&lt;-[e:follow]- (v2)-[e2:serve]-&gt;(v3)  \
        WHERE id(v) == &#39;player100&#39; \
        RETURN v2.player.name AS FriendOf, v3.team.name AS Team;
+---------------------+-----------------+
| FriendOf            | Team            |
+---------------------+-----------------+
| &quot;Boris Diaw&quot;        | &quot;Spurs&quot;         |
| &quot;Boris Diaw&quot;        | &quot;Jazz&quot;          |
| &quot;Boris Diaw&quot;        | &quot;Suns&quot;          |
...
</code></pre></div>
<h3 id="to_use_group_by_to_group_the_output">To use <code>GROUP BY</code> to group the output<a class="headerlink" href="#to_use_group_by_to_group_the_output" title="Permanent link">&para;</a></h3>
<p>You need to use <code>YIELD</code> to define the output that needs to be returned after grouping.</p>
<div class="highlight"><pre><span></span><code># The following example collects the outputs according to age.
nebula&gt; GO 2 STEPS FROM &quot;player100&quot; OVER follow \
        YIELD src(edge) AS src, dst(edge) AS dst, properties($$).age AS age \
        | GROUP BY $-.dst \
        YIELD $-.dst AS dst, collect_set($-.src) AS src, collect($-.age) AS age;
+-------------+----------------------------+----------+
| dst         | src                        | age      |
+-------------+----------------------------+----------+
| &quot;player125&quot; | {&quot;player101&quot;}              | [41]     |
| &quot;player100&quot; | {&quot;player125&quot;, &quot;player101&quot;} | [42, 42] |
| &quot;player102&quot; | {&quot;player101&quot;}              | [33]     |
+-------------+----------------------------+----------+
</code></pre></div>
<h3 id="to_use_order_by_and_limit_to_sort_and_limit_the_output">To use <code>ORDER BY</code> and <code>LIMIT</code> to sort and limit the output<a class="headerlink" href="#to_use_order_by_and_limit_to_sort_and_limit_the_output" title="Permanent link">&para;</a></h3>
<div class="highlight"><pre><span></span><code># The following example groups the outputs and restricts the number of rows of the outputs.
nebula&gt; $a = GO FROM &quot;player100&quot; OVER follow YIELD src(edge) AS src, dst(edge) AS dst; \
        GO 2 STEPS FROM $a.dst OVER follow \
        YIELD $a.src AS src, $a.dst, src(edge), dst(edge) \
        | ORDER BY $-.src | OFFSET 1 LIMIT 2;
+-------------+-------------+-------------+-------------+
| src         | $a.dst      | src(EDGE)   | dst(EDGE)   |
+-------------+-------------+-------------+-------------+
| &quot;player100&quot; | &quot;player101&quot; | &quot;player100&quot; | &quot;player101&quot; |
| &quot;player100&quot; | &quot;player125&quot; | &quot;player100&quot; | &quot;player125&quot; |
+-------------+-------------+-------------+-------------+
</code></pre></div>
<h3 id="other_examples">Other examples<a class="headerlink" href="#other_examples" title="Permanent link">&para;</a></h3>
<div class="highlight"><pre><span></span><code># The following example determines if $$.player.name IS NOT EMPTY.
nebula&gt; GO FROM &quot;player100&quot; OVER follow WHERE properties($$).name IS NOT EMPTY YIELD dst(edge);
+-------------+
| dst(EDGE)   |
+-------------+
| &quot;player125&quot; |
| &quot;player101&quot; |
+-------------+
</code></pre></div>





                
              </article>
            </div>
          
          
        </div>
        
      </main>
      
        <footer class="md-footer">
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-copyright">
  
  
    Made with
    <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
      Material for MkDocs
    </a>
  
</div>
      
        <div class="md-social">
  
    
    
    
    
      
      
    
    <a href="https://github.com/vesoft-inc/nebula-docs-cn" target="_blank" rel="noopener" title="github.com" class="md-social__link">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
    </a>
  
</div>
      
    </div>
  </div>
</footer>
      
    </div>
    <div class="md-dialog" data-md-component="dialog">
      <div class="md-dialog__inner md-typeset"></div>
    </div>
    
    
    <script id="__config" type="application/json">{"base": "../../..", "features": ["navigation.tabs", "navigation.tabs.sticky"], "search": "../../../assets/javascripts/workers/search.f886a092.min.js", "translations": {"clipboard.copied": "Copied to clipboard", "clipboard.copy": "Copy to clipboard", "search.result.more.one": "1 more on this page", "search.result.more.other": "# more on this page", "search.result.none": "No matching documents", "search.result.one": "1 matching document", "search.result.other": "# matching documents", "search.result.placeholder": "Type to start searching", "search.result.term.missing": "Missing", "select.version": "Select version"}, "version": {"provider": "mike"}}</script>
    
    
      <script src="../../../assets/javascripts/bundle.aecac24b.min.js"></script>
      
    
  </body>
</html>