
<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
      
      
        <link rel="canonical" href="https://chrischen2023.github.io/multi_lang_test/2.0.0/3.ngql-guide/7.general-query-statements/2.match/">
      
      
      
      
      <link rel="icon" href="https://docs-cdn.nebula-graph.com.cn/figures/favicon.ico">
      <meta name="generator" content="mkdocs-1.5.3, mkdocs-material-9.4.6">
    
    
      
        <title>MATCH - Chris Docs</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/main.35e1ed30.min.css">
      
        
        <link rel="stylesheet" href="../../../assets/stylesheets/palette.356b1318.min.css">
      
      


    
    
      
    
    
      
        
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,300i,400,400i,700,700i%7CRoboto+Mono:400,400i,700,700i&display=fallback">
        <style>:root{--md-text-font:"Roboto";--md-code-font:"Roboto Mono"}</style>
      
    
    
      <link rel="stylesheet" href="../../../stylesheets/note.css">
    
    <script>__md_scope=new URL("../../..",location),__md_hash=e=>[...e].reduce((e,_)=>(e<<5)-e+_.charCodeAt(0),0),__md_get=(e,_=localStorage,t=__md_scope)=>JSON.parse(_.getItem(t.pathname+"."+e)),__md_set=(e,_,t=localStorage,a=__md_scope)=>{try{t.setItem(a.pathname+"."+e,JSON.stringify(_))}catch(e){}}</script>
    
      

    
    
    
  </head>
  
  
    
    
      
    
    
    
    
    <body dir="ltr" data-md-color-scheme="nebula" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    
    
      <script>var palette=__md_get("__palette");if(palette&&"object"==typeof palette.color)for(var key of Object.keys(palette.color))document.body.setAttribute("data-md-color-"+key,palette.color[key])</script>
    
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" for="__drawer"></label>
    <div data-md-component="skip">
      
        
        <a href="#match" class="md-skip">
          Skip to content
        </a>
      
    </div>
    <div data-md-component="announce">
      
        <aside class="md-banner">
          <div class="md-banner__inner md-grid md-typeset">
            
            
Insider: Document versions starting from 3.6.0 contain Community Edition features only. For Enterprise documentation, please <a href="https://yueshu.com.cn/contact">Contact us</a>. <a href="../../../.."> 
  <strong>Click here to go to latest.</strong>
</a>


          </div>
          
        </aside>
      
    </div>
    
      <div data-md-color-scheme="default" data-md-component="outdated" hidden>
        
          <aside class="md-banner md-banner--warning">
            <div class="md-banner__inner md-grid md-typeset">
              
  Insider: You're not viewing the latest version.
  <a href="../../../.."> 
    <strong>Click here to go to latest.</strong>
  </a>

            </div>
            <script>var el=document.querySelector("[data-md-component=outdated]"),outdated=__md_get("__outdated",sessionStorage);!0===outdated&&el&&(el.hidden=!1)</script>
          </aside>
        
      </div>
    
    
      

  

<header class="md-header md-header--shadow md-header--lifted" data-md-component="header">
  <nav class="md-header__inner md-grid" aria-label="Header">
    <a href="../../.." title="Chris Docs" class="md-header__button md-logo" aria-label="Chris Docs" data-md-component="logo">
      
  <img src="https://docs-cdn.nebula-graph.com.cn/figures/vesoft-nebula-logo-white22-12-21.png" alt="logo">

    </a>
    <label class="md-header__button md-icon" for="__drawer">
      
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M3 6h18v2H3V6m0 5h18v2H3v-2m0 5h18v2H3v-2Z"/></svg>
    </label>
    <div class="md-header__title" data-md-component="header-title">
      <div class="md-header__ellipsis">
        <div class="md-header__topic">
          <span class="md-ellipsis">
            Chris Docs
          </span>
        </div>
        <div class="md-header__topic" data-md-component="header-topic">
          <span class="md-ellipsis">
            
              MATCH
            
          </span>
        </div>
      </div>
    </div>
    
      
        <form class="md-header__option" data-md-component="palette">
  
    
    
    
    <input class="md-option" data-md-color-media="" data-md-color-scheme="nebula" data-md-color-primary="indigo" data-md-color-accent="indigo"  aria-label="Switch to dark mode"  type="radio" name="__palette" id="__palette_1">
    
      <label class="md-header__button md-icon" title="Switch to dark mode" for="__palette_2" hidden>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M17 6H7c-3.31 0-6 2.69-6 6s2.69 6 6 6h10c3.31 0 6-2.69 6-6s-2.69-6-6-6zm0 10H7c-2.21 0-4-1.79-4-4s1.79-4 4-4h10c2.21 0 4 1.79 4 4s-1.79 4-4 4zM7 9c-1.66 0-3 1.34-3 3s1.34 3 3 3 3-1.34 3-3-1.34-3-3-3z"/></svg>
      </label>
    
  
    
    
    
    <input class="md-option" data-md-color-media="" data-md-color-scheme="slate" data-md-color-primary="indigo" data-md-color-accent="indigo"  aria-label="Switch to light mode"  type="radio" name="__palette" id="__palette_2">
    
      <label class="md-header__button md-icon" title="Switch to light mode" for="__palette_1" hidden>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M17 7H7a5 5 0 0 0-5 5 5 5 0 0 0 5 5h10a5 5 0 0 0 5-5 5 5 0 0 0-5-5m0 8a3 3 0 0 1-3-3 3 3 0 0 1 3-3 3 3 0 0 1 3 3 3 3 0 0 1-3 3Z"/></svg>
      </label>
    
  
</form>
      
    
    
    
      <label class="md-header__button md-icon" for="__search">
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5Z"/></svg>
      </label>
      <div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" aria-label="Search" placeholder="Search" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="search-query" required>
      <label class="md-search__icon md-icon" for="__search">
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5Z"/></svg>
        
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12Z"/></svg>
      </label>
      <nav class="md-search__options" aria-label="Search">
        
        <button type="reset" class="md-search__icon md-icon" title="Clear" aria-label="Clear" tabindex="-1">
          
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M19 6.41 17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41Z"/></svg>
        </button>
      </nav>
      
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="search-result">
          <div class="md-search-result__meta">
            Initializing search
          </div>
          <ol class="md-search-result__list" role="presentation"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
    
    
      <div class="md-header__source">
        <a href="https://github.com/ChrisChen2023/multi_lang_test" title="Go to repository" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
  </div>
  <div class="md-source__repository">
    multi_lang_test
  </div>
</a>
      </div>
    
  </nav>
  
    
      
<nav class="md-tabs" aria-label="Tabs" data-md-component="tabs">
  <div class="md-grid">
    <ul class="md-tabs__list">
      
        
  
  
  
    <li class="md-tabs__item">
      <a href="../../.." class="md-tabs__link">
        
  
    
  
  Home

      </a>
    </li>
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-tabs__link">
          
  
  Introduction

        </a>
      </li>
    
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../2.quick-start/1.quick-start-workflow/" class="md-tabs__link">
          
  
  Quick start

        </a>
      </li>
    
  

      
        
  
  
  
    
    
      
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../1.nGQL-overview/1.overview/" class="md-tabs__link">
          
  
  nGQL guide

        </a>
      </li>
    
  

    
  

      
        
  
  
  
    
    
      <li class="md-tabs__item">
        <a href="../../../nebula-dashboard/1.what-is-dashboard/" class="md-tabs__link">
          
  
  Dashboard (Community)

        </a>
      </li>
    
  

      
    </ul>
  </div>
</nav>
    
  
</header>
    
    <div class="md-container" data-md-component="container">
      
      
        
      
      <main class="md-main" data-md-component="main">
        <div class="md-main__inner md-grid">
          
            
              
              <div class="md-sidebar md-sidebar--primary" data-md-component="sidebar" data-md-type="navigation" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    


  


<nav class="md-nav md-nav--primary md-nav--lifted" aria-label="Navigation" data-md-level="0">
  <label class="md-nav__title" for="__drawer">
    <a href="../../.." title="Chris Docs" class="md-nav__button md-logo" aria-label="Chris Docs" data-md-component="logo">
      
  <img src="https://docs-cdn.nebula-graph.com.cn/figures/vesoft-nebula-logo-white22-12-21.png" alt="logo">

    </a>
    Chris Docs
  </label>
  
    <div class="md-nav__source">
      <a href="https://github.com/ChrisChen2023/multi_lang_test" title="Go to repository" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
  </div>
  <div class="md-source__repository">
    multi_lang_test
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
  
  
  
    <li class="md-nav__item">
      <a href="../../.." class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Home
  </span>
  

      </a>
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_2" >
        
          
          <label class="md-nav__link" for="__nav_2" id="__nav_2_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Introduction
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_2_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_2">
            <span class="md-nav__icon md-icon"></span>
            Introduction
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    What is NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.data-model/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Data model
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.1.path/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Path
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.vid/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    VID
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_2_5" >
        
          
          <label class="md-nav__link" for="__nav_2_5" id="__nav_2_5_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    NebulaGraph architecture
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_2_5_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_2_5">
            <span class="md-nav__icon md-icon"></span>
            NebulaGraph architecture
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Architecture overview
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Meta Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Graph Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Storage Service
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_3" >
        
          
          <label class="md-nav__link" for="__nav_3" id="__nav_3_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Quick start
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_3_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_3">
            <span class="md-nav__icon md-icon"></span>
            Quick start
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/1.quick-start-workflow/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Deploy NebulaGraph using Docker
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_3_2" >
        
          
          <label class="md-nav__link" for="__nav_3_2" id="__nav_3_2_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    Deploy NebulaGraph on-premise
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_3_2_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_3_2">
            <span class="md-nav__icon md-icon"></span>
            Deploy NebulaGraph on-premise
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/2.install-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 1 Install NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/5.start-stop-service/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 2 Manage NebulaGraph Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.connect-to-nebula-graph/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 3 Connect to NebulaGraph
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.1add-storage-hosts/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 4 Register the Storage Service
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/4.nebula-graph-crud/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Step 5 Use nGQL (CRUD)
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/6.cheatsheet-for-ngql/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    nGQL cheatsheet
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_4" >
        
          
          <label class="md-nav__link" for="__nav_4" id="__nav_4_label" tabindex="">
            
  
  <span class="md-ellipsis">
    nGQL guide
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_4_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_4">
            <span class="md-nav__icon md-icon"></span>
            nGQL guide
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    
    
    
    
    
    <li class="md-nav__item md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_4_1" >
        
          
          <label class="md-nav__link" for="__nav_4_1" id="__nav_4_1_label" tabindex="0">
            
  
  <span class="md-ellipsis">
    nGQL overview
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="2" aria-labelledby="__nav_4_1_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_4_1">
            <span class="md-nav__icon md-icon"></span>
            nGQL overview
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/1.overview/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Overview
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/3.graph-patterns/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Graph patterns
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/comments/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Comments
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/identifier-case-sensitivity/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Identifier case sensitivity
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/keywords-and-reserved-words/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Keywords
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/ngql-style-guide/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    nGQL style guide
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
      
      
  
  
  
    
    
    
    
    
      
      
    
    <li class="md-nav__item md-nav__item--section md-nav__item--nested">
      
        
        
        
        <input class="md-nav__toggle md-toggle " type="checkbox" id="__nav_5" >
        
          
          <label class="md-nav__link" for="__nav_5" id="__nav_5_label" tabindex="">
            
  
  <span class="md-ellipsis">
    Dashboard (Community)
  </span>
  

            <span class="md-nav__icon md-icon"></span>
          </label>
        
        <nav class="md-nav" data-md-level="1" aria-labelledby="__nav_5_label" aria-expanded="false">
          <label class="md-nav__title" for="__nav_5">
            <span class="md-nav__icon md-icon"></span>
            Dashboard (Community)
          </label>
          <ul class="md-nav__list" data-md-scrollfix>
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/1.what-is-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    What is NebulaGraph Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/2.deploy-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Deploy Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/3.connect-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Connect to Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/4.use-dashboard/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Use Dashboard
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-dashboard/6.monitor-parameter/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    Monitoring metrics
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              
              <div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    

<nav class="md-nav md-nav--secondary" aria-label="Table of contents">
  
  
  
    
  
  
    <label class="md-nav__title" for="__toc">
      <span class="md-nav__icon md-icon"></span>
      Table of contents
    </label>
    <ul class="md-nav__list" data-md-component="toc" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#syntax" class="md-nav__link">
    Syntax
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#notes" class="md-nav__link">
    Notes
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#using_patterns_in_match_statements" class="md-nav__link">
    Using patterns in MATCH statements
  </a>
  
    <nav class="md-nav" aria-label="Using patterns in MATCH statements">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#match_vertices" class="md-nav__link">
    Match vertices
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_tags" class="md-nav__link">
    Match tags
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_vertex_properties" class="md-nav__link">
    Match vertex properties
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_vids" class="md-nav__link">
    Match VIDs
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_connected_vertices" class="md-nav__link">
    Match connected vertices
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_paths" class="md-nav__link">
    Match paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_edges" class="md-nav__link">
    Match edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_edge_types" class="md-nav__link">
    Match edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_edge_type_properties" class="md-nav__link">
    Match edge type properties
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_multiple_edge_types" class="md-nav__link">
    Match multiple edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_multiple_edges" class="md-nav__link">
    Match multiple edges
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_fixed-length_paths" class="md-nav__link">
    Match fixed-length paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_variable-length_paths" class="md-nav__link">
    Match variable-length paths
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_variable-length_paths_with_multiple_edge_types" class="md-nav__link">
    Match variable-length paths with multiple edge types
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_multiple_patterns" class="md-nav__link">
    Match multiple patterns
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#match_shortest_paths" class="md-nav__link">
    Match shortest paths
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#retrieve_with_multiple_match" class="md-nav__link">
    Retrieve with multiple match
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#retrieve_with_optional_match" class="md-nav__link">
    Retrieve with optional match
  </a>
  
</li>
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          
            <div class="md-content" data-md-component="content">
              <article class="md-content__inner md-typeset">
                
                  

  
  


<h1 id="match">MATCH<a class="headerlink" href="#match" title="Permanent link">&para;</a></h1>
<p>The <code>MATCH</code> statement provides pattern-based search functionality, allowing you to retrieve data that matches one or more patterns in NebulaGraph. By defining one or more patterns, you can search for data that matches the patterns in NebulaGraph. Once the matching data is retrieved, you can use the <code>RETURN</code> clause to return it as a result.</p>
<p>The examples in this topic use the <a href="../../1.nGQL-overview/1.overview/#example_data_basketballplayer">basketballplayer</a> dataset as the sample dataset.</p>
<h2 id="syntax">Syntax<a class="headerlink" href="#syntax" title="Permanent link">&para;</a></h2>
<p>The syntax of <code>MATCH</code> is relatively more flexible compared with that of other query statements such as <code>GO</code> or <code>LOOKUP</code>. The path type of the <code>MATCH</code> statement is <code>trail</code>. That is, only vertices can be repeatedly visited in the graph traversal. Edges cannot be repeatedly visited. For details, see <a href="../../../1.introduction/2.1.path/">path</a>. But generally, it can be summarized as follows.</p>
<div class="highlight"><pre><span></span><code>MATCH &lt;pattern&gt; [&lt;clause_1&gt;] RETURN &lt;output&gt; [&lt;clause_2&gt;];
</code></pre></div>
<ul>
<li><code>pattern</code>: The <code>MATCH</code> statement supports matching one or multiple patterns. Multiple patterns are separated by commas (,). For example: <code>(a)-[]-&gt;(b),(c)-[]-&gt;(d)</code>. For the detailed description of patterns, see <a href="../../1.nGQL-overview/3.graph-patterns/">Patterns</a>. </li>
</ul>
<ul>
<li><code>clause_1</code>: The <code>WHERE</code>, <code>WITH</code>, <code>UNWIND</code>, and <code>OPTIONAL MATCH</code> clauses are supported, and the <code>MATCH</code> clause can also be used.</li>
</ul>
<ul>
<li><code>output</code>: Define the list name for the output results to be returned. You can use <code>AS</code> to set an alias for the list.</li>
</ul>
<ul>
<li><code>clause_2</code>: The <code>ORDER BY</code> and <code>LIMIT</code> clauses are supported.</li>
</ul>
<div class="admonition compatibility">
<p class="admonition-title">Legacy version compatibility</p>
<ul>
<li>Starting from version 3.5.0, the <code>MATCH</code> statement supports full table scans. It can traverse vertices or edges in the graph without using any indexes or filter conditions. In previous versions, the <code>MATCH</code> statement required an index for certain queries or needed to use <code>LIMIT</code> to restrict the number of output results.</li>
</ul>
<ul>
<li>Starting from NebulaGraph version 3.0.0, in order to distinguish the properties of different tags, you need to specify a tag name when querying properties. The original statement <code>RETURN &lt;variable_name&gt;.&lt;property_name&gt;</code> is changed to <code>RETURN &lt;variable_name&gt;.&lt;tag_name&gt;.&lt;property_name&gt;</code>.</li>
</ul>
</div>
<h2 id="notes">Notes<a class="headerlink" href="#notes" title="Permanent link">&para;</a></h2>
<ul>
<li>Avoid full table scans, as they may result in decreased query performance, and if there is insufficient memory during a full table scan, the query may fail, and the system will report an error. It is recommended to use queries with filter conditions or specifying tags and edge types, such as <code>v:player</code> and <code>v.player.name</code> in the statement <code>MATCH (v:player) RETURN v.player.name AS Name</code>.</li>
</ul>
<ul>
<li>You can create an index for a tag, edge type, or a specific property of a tag or edge type to improve query performance. For example, you can create an index for the <code>player</code> tag or the name property of the <code>player</code> tag. For more information about the usage and considerations for indexes, see <a href="../../14.native-index-statements/1.create-native-index/">Must-read for using indexes</a>.</li>
</ul>
<ul>
<li>The <code>MATCH</code> statement cannot query dangling edges.</li>
</ul>
<h2 id="using_patterns_in_match_statements">Using patterns in MATCH statements<a class="headerlink" href="#using_patterns_in_match_statements" title="Permanent link">&para;</a></h2>
<h3 id="match_vertices">Match vertices<a class="headerlink" href="#match_vertices" title="Permanent link">&para;</a></h3>
<p>You can use a user-defined variable in a pair of parentheses to represent a vertex in a pattern. For example: <code>(v)</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) \
        RETURN v \
        LIMIT 3;
+-----------------------------------------------------------+
| v                                                         |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
| (&quot;player106&quot; :player{age: 25, name: &quot;Kyle Anderson&quot;})     |
| (&quot;player115&quot; :player{age: 40, name: &quot;Kobe Bryant&quot;})       |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="match_tags">Match tags<a class="headerlink" href="#match_tags" title="Permanent link">&para;</a></h3>
<div class="admonition compatibility">
<p class="admonition-title">Legacy version compatibility</p>
<ul>
<li>In NebulaGraph versions earlier than 3.0.0, the prerequisite for matching a tag is that the tag itself has an index or a certain property of the tag has an index. </li>
</ul>
<ul>
<li>Starting from NebulaGraph 3.0.0, you can match tags without creating an index, but you need to use <code>LIMIT</code> to restrict the number of output results.</li>
</ul>
<ul>
<li>Starting from NebulaGraph 3.5.0, the <code>MATCH</code> statement supports full table scans. There is no need to create an index for a tag or a specific property of a tag, nor use <code>LIMIT</code> to restrict the number of output results in order to execute the <code>MATCH</code> statement.</li>
</ul>
</div>
<p>You can specify a tag with <code>:&lt;tag_name&gt;</code> after the vertex in a pattern.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) \
        RETURN v;
+---------------------------------------------------------------+
| v                                                             |
+---------------------------------------------------------------+
| (&quot;player105&quot; :player{age: 31, name: &quot;Danny Green&quot;})           |
| (&quot;player109&quot; :player{age: 34, name: &quot;Tiago Splitter&quot;})        |
| (&quot;player111&quot; :player{age: 38, name: &quot;David West&quot;})            |
...
</code></pre></div>
<p>To match vertices with multiple tags, use colons (:).</p>
<div class="highlight"><pre><span></span><code>nebula&gt; CREATE TAG actor (name string, age int);
nebula&gt; INSERT VERTEX actor(name, age) VALUES &quot;player100&quot;:(&quot;Tim Duncan&quot;, 42);
nebula&gt; MATCH (v:player:actor) \
        RETURN v \
+----------------------------------------------------------------------------------------+
| v                                                                                      |
+----------------------------------------------------------------------------------------+
| (&quot;player100&quot; :actor{age: 42, name: &quot;Tim Duncan&quot;} :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------------------------------------------+
</code></pre></div>
<h3 id="match_vertex_properties">Match vertex properties<a class="headerlink" href="#match_vertex_properties" title="Permanent link">&para;</a></h3>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>The prerequisite for matching a vertex property is that the tag itself has an index of the corresponding property. Otherwise, you cannot execute the <code>MATCH</code> statement to match the property.</p>
</div>
<p>You can specify a vertex property with <code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code> after the tag in a pattern.</p>
<div class="highlight"><pre><span></span><code># The following example uses the name property to match a vertex.
nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+
</code></pre></div>
<p>The <code>WHERE</code> clause can do the same thing:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) \
        WHERE v.player.name == &quot;Tim Duncan&quot; \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">OpenCypher compatibility</p>
<p>In openCypher 9, <code>=</code> is the equality operator. However, in nGQL, <code>==</code> is the equality operator and <code>=</code> is the assignment operator (as in C++ or Java).</p>
</div>
<p>Use the <code>WHERE</code> clause to directly get all the vertices with the vertex property value Tim Duncan.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) \
        WITH v, properties(v) as props, keys(properties(v)) as kk \
        WHERE [i in kk where props[i] == &quot;Tim Duncan&quot;] \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+

nebula&gt; WITH [&#39;Tim Duncan&#39;, &#39;Yao Ming&#39;] AS names \
        MATCH (v1:player)--&gt;(v2:player) \
        WHERE v1.player.name in names \
        return v1, v2;
+----------------------------------------------------+----------------------------------------------------------+
| v1                                                 | v2                                                       |
+----------------------------------------------------+----------------------------------------------------------+
| (&quot;player133&quot; :player{age: 38, name: &quot;Yao Ming&quot;})   | (&quot;player114&quot; :player{age: 39, name: &quot;Tracy McGrady&quot;})    |
| (&quot;player133&quot; :player{age: 38, name: &quot;Yao Ming&quot;})   | (&quot;player144&quot; :player{age: 47, name: &quot;Shaquille O&#39;Neal&quot;}) |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) | (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})      |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) | (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})    |
+----------------------------------------------------+----------------------------------------------------------+
</code></pre></div>
<h3 id="match_vids">Match VIDs<a class="headerlink" href="#match_vids" title="Permanent link">&para;</a></h3>
<p>You can use the VID to match a vertex. The <code>id()</code> function can retrieve the VID of a vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) \
        WHERE id(v) == &#39;player101&#39; \
        RETURN v;
+-----------------------------------------------------+
| v                                                   |
+-----------------------------------------------------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;}) |
+-----------------------------------------------------+
</code></pre></div>
<p>To match multiple VIDs, use <code>WHERE id(v) IN [vid_list]</code> or <code>WHERE id(v) IN {vid_list}</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player { name: &#39;Tim Duncan&#39; })--(v2) \
        WHERE id(v2) IN [&quot;player101&quot;, &quot;player102&quot;] \
        RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
+-----------------------------------------------------------+

nebula&gt; MATCH (v) WHERE id(v) IN {&quot;player100&quot;, &quot;player101&quot;} \
        RETURN v.player.name AS name;
+---------------+
| name          |
+---------------+
| &quot;Tony Parker&quot; |
| &quot;Tim Duncan&quot;  |
+---------------+
</code></pre></div>
<h3 id="match_connected_vertices">Match connected vertices<a class="headerlink" href="#match_connected_vertices" title="Permanent link">&para;</a></h3>
<p>You can use the <code>--</code> symbol to represent edges of both directions and match vertices connected by these edges.</p>
<div class="admonition compatibility">
<p class="admonition-title">Legacy version compatibility</p>
<p>In nGQL 1.x, the <code>--</code> symbol is used for inline comments. Starting from nGQL 2.x, the <code>--</code> symbol represents an incoming or outgoing edge.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--(v2) \
        RETURN v2.player.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Manu Ginobili&quot;     |
| &quot;Manu Ginobili&quot;     |
| &quot;Tiago Splitter&quot;    |
...
</code></pre></div>
<p>You can add a <code>&gt;</code> or <code>&lt;</code> to the <code>--</code> symbol to specify the direction of an edge.</p>
<p>In the following example, <code>--&gt;</code> represents an edge that starts from <code>v</code> and points to <code>v2</code>. To <code>v</code>, this is an outgoing edge, and to <code>v2</code> this is an incoming edge.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2:player) \
        RETURN v2.player.name AS Name;
+-----------------+
| Name            |
+-----------------+
| &quot;Manu Ginobili&quot; |
| &quot;Tony Parker&quot;   |
+-----------------+
</code></pre></div>
<p>To query the properties of the target vertices, use the <code>CASE</code> expression.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--(v2) \
        RETURN \
        CASE WHEN v2.team.name IS NOT NULL \
        THEN v2.team.name  \
        WHEN v2.player.name IS NOT NULL \
        THEN v2.player.name END AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Manu Ginobili&quot;     |
| &quot;Manu Ginobili&quot;     |
| &quot;Spurs&quot;             |
| &quot;Dejounte Murray&quot;   |
...
</code></pre></div>
<p>To extend the pattern, you can add more vertices and edges.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2)&lt;--(v3) \
        RETURN v3.player.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Dejounte Murray&quot;   |
| &quot;LaMarcus Aldridge&quot; |
| &quot;Marco Belinelli&quot;   |
...
</code></pre></div>
<p>If you do not need to refer to a vertex, you can omit the variable representing it in the parentheses.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;()&lt;--(v3) \
        RETURN v3.player.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Dejounte Murray&quot;   |
| &quot;LaMarcus Aldridge&quot; |
| &quot;Marco Belinelli&quot;   |
...
</code></pre></div>
<h3 id="match_paths">Match paths<a class="headerlink" href="#match_paths" title="Permanent link">&para;</a></h3>
<p>Connected vertices and edges form a path. You can use a user-defined variable to name a path as follows.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2) \
        RETURN p;
+--------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                    |
+--------------------------------------------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt; |
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt;   |
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt; |
+--------------------------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<div class="admonition compatibility">
<p class="admonition-title">OpenCypher compatibility</p>
<p>In nGQL, the <code>@</code> symbol represents the rank of an edge, but openCypher has no such concept.</p>
</div>
<h3 id="match_edges">Match edges<a class="headerlink" href="#match_edges" title="Permanent link">&para;</a></h3>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH ()&lt;-[e]-() \
        RETURN e \
        LIMIT 3;
+----------------------------------------------------+
| e                                                  |
+----------------------------------------------------+
| [:follow &quot;player101&quot;-&gt;&quot;player102&quot; @0 {degree: 90}] |
| [:follow &quot;player103&quot;-&gt;&quot;player102&quot; @0 {degree: 70}] |
| [:follow &quot;player135&quot;-&gt;&quot;player102&quot; @0 {degree: 80}] |
+----------------------------------------------------+
</code></pre></div>
<h3 id="match_edge_types">Match edge types<a class="headerlink" href="#match_edge_types" title="Permanent link">&para;</a></h3>
<p>Just like vertices, you can specify edge types with <code>:&lt;edge_type&gt;</code> in a pattern. For example: <code>-[e:follow]-</code>.</p>
<div class="admonition compatibility">
<p class="admonition-title">OpenCypher compatibility</p>
<ul>
<li>In NebulaGraph versions earlier than 3.0.0, the prerequisite for matching a edge type is that the edge type itself has an index or a certain property of the edge type has an index. </li>
</ul>
<ul>
<li>Starting from version 3.0.0, there is no need to create an index for matching a edge type, but you need to use <code>LIMIT</code> to limit the number of output results and you must specify the direction of the edge.</li>
</ul>
<ul>
<li>Starting from NebulaGraph 3.5.0, you can use the <code>MATCH</code> statement to match edges without creating an index for edge type or using <code>LIMIT</code> to restrict the number of output results.</li>
</ul>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH ()-[e:follow]-&gt;() \
        RETURN e;
+----------------------------------------------------+
| e                                                  |
+----------------------------------------------------+
| [:follow &quot;player102&quot;-&gt;&quot;player100&quot; @0 {degree: 75}] |
| [:follow &quot;player102&quot;-&gt;&quot;player101&quot; @0 {degree: 75}] |
| [:follow &quot;player129&quot;-&gt;&quot;player116&quot; @0 {degree: 90}] |
...
</code></pre></div>
<h3 id="match_edge_type_properties">Match edge type properties<a class="headerlink" href="#match_edge_type_properties" title="Permanent link">&para;</a></h3>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>The prerequisite for matching an edge type property is that the edge type itself has an index of the corresponding property. Otherwise, you cannot execute the <code>MATCH</code> statement to match the property.</p>
</div>
<p>You can specify edge type properties with <code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code> in a pattern. For example: <code>[e:follow{likeness:95}]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:follow{degree:95}]-&gt;(v2) \
        RETURN e;
+--------------------------------------------------------+
| e                                                      |
+--------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]     |
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]     |
+--------------------------------------------------------+
</code></pre></div>
<p>Use the <code>WHERE</code> clause to directly get all the edges with the edge property value 90.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH ()-[e]-&gt;() \
        WITH e, properties(e) as props, keys(properties(e)) as kk \
        WHERE [i in kk where props[i] == 90] \
        RETURN e;
+----------------------------------------------------+
| e                                                  |
+----------------------------------------------------+
| [:follow &quot;player125&quot;-&gt;&quot;player100&quot; @0 {degree: 90}] |
| [:follow &quot;player140&quot;-&gt;&quot;player114&quot; @0 {degree: 90}] |
| [:follow &quot;player133&quot;-&gt;&quot;player144&quot; @0 {degree: 90}] |
| [:follow &quot;player133&quot;-&gt;&quot;player114&quot; @0 {degree: 90}] |
...
+----------------------------------------------------+
</code></pre></div>
<h3 id="match_multiple_edge_types">Match multiple edge types<a class="headerlink" href="#match_multiple_edge_types" title="Permanent link">&para;</a></h3>
<p>The <code>|</code> symbol can help matching multiple edge types. For example: <code>[e:follow|:serve]</code>. The English colon (:) before the first edge type cannot be omitted, but the English colon before the subsequent edge type can be omitted, such as <code>[e:follow|serve]</code>.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:follow|:serve]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]                        |
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]                        |
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="match_multiple_edges">Match multiple edges<a class="headerlink" href="#match_multiple_edges" title="Permanent link">&para;</a></h3>
<p>You can extend a pattern to match multiple edges in a path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2)&lt;-[e:serve]-(v3) \
        RETURN v2, v3;
+----------------------------------+-----------------------------------------------------------+
| v2                               | v3                                                        |
+----------------------------------+-----------------------------------------------------------+
| (&quot;team204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player104&quot; :player{age: 32, name: &quot;Marco Belinelli&quot;})   |
| (&quot;team204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
| (&quot;team204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
...
</code></pre></div>
<h3 id="match_fixed-length_paths">Match fixed-length paths<a class="headerlink" href="#match_fixed-length_paths" title="Permanent link">&para;</a></h3>
<p>You can use the <code>:&lt;edge_type&gt;*&lt;hop&gt;</code> pattern to match a fixed-length path. <code>hop</code> must be a non-negative integer.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*2]-&gt;(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        |
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
+-----------------------------------------------------------+
</code></pre></div>
<p>If <code>hop</code> is 0, the pattern will match the source vertex of the path.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) -[*0]-&gt; (v2) \
        RETURN v2;
+----------------------------------------------------+
| v2                                                 |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>When you conditionally filter on multi-hop edges, such as <code>-[e:follow*2]-&gt;</code>, note that the <code>e</code> is a list of edges instead of a single edge. </p>
<p>For example, the following statement is correct from the syntax point of view which may not get your expected query result, because the <code>e</code> is a list without the <code>.degree</code> property. </p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*2]-&gt;(v2) \
        WHERE e.degree &gt; 1 \
        RETURN DISTINCT v2 AS Friends;
</code></pre></div>
<p>The correct statement is as follows:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*2]-&gt;(v2) \
        WHERE ALL(e_ in e WHERE e_.degree &gt; 0) \
        RETURN DISTINCT v2 AS Friends;
</code></pre></div>
<p>Further, the following statement is for filtering the properties of the first-hop edge in multi-hop edges:</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*2]-&gt;(v2) \
        WHERE e[0].degree &gt; 98 \
        RETURN DISTINCT v2 AS Friends;
</code></pre></div>
</div>
<h3 id="match_variable-length_paths">Match variable-length paths<a class="headerlink" href="#match_variable-length_paths" title="Permanent link">&para;</a></h3>
<p>You can use the <code>:&lt;edge_type&gt;*[minHop..maxHop]</code> pattern to match variable-length paths.<code>minHop</code> and <code>maxHop</code> are optional and default to 1
and infinity respectively.</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>When setting bounds, at least one of <code>minHop</code> and <code>maxHop</code> exists.</p>
</div>
<div class="admonition caution">
<p class="admonition-title">Caution</p>
<p>If <code>maxHop</code> is not set, it may cause the Graph service to OOM, execute this command with caution.</p>
</div>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
...

nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*1..3]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        |
...

nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*1..]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        |
...
</code></pre></div>
<p>You can use the <code>DISTINCT</code> keyword to aggregate duplicate results.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*1..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | count(v2) |
+-----------------------------------------------------------+-----------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) | 1         |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        | 4         |
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       | 3         |
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     | 3         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<p>If <code>minHop</code> is <code>0</code>, the pattern will match the source vertex of the path. Compared to the preceding statement, the following example uses <code>0</code> as the <code>minHop</code>. So in the following result set, <code>"Tim Duncan"</code> is counted one more time than it is in the preceding result set because it is the source vertex.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*0..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | count(v2) |
+-----------------------------------------------------------+-----------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) | 1         |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        | 5         |
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     | 3         |
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       | 3         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>When using the variable <code>e</code> to match fixed-length or variable-length paths in a pattern, such as <code>-[e:follow*0..3]-&gt;</code>, it is not supported to reference <code>e</code> in other patterns. For example, the following statement is not supported.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player)-[e:like*1..3]-&gt;(n) \
        WHERE (n)-[e*1..4]-&gt;(:player) \
        RETURN v;
</code></pre></div>
</div>
<h3 id="match_variable-length_paths_with_multiple_edge_types">Match variable-length paths with multiple edge types<a class="headerlink" href="#match_variable-length_paths_with_multiple_edge_types" title="Permanent link">&para;</a></h3>
<p>You can specify multiple edge types in a fixed-length or variable-length pattern. In this case, <code>hop</code>, <code>minHop</code>, and <code>maxHop</code> take effect on all edge types.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow|serve*2]-&gt;(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;team204&quot; :team{name: &quot;Spurs&quot;})                          |
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        |
| (&quot;team215&quot; :team{name: &quot;Hornets&quot;})                        |
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="match_multiple_patterns">Match multiple patterns<a class="headerlink" href="#match_multiple_patterns" title="Permanent link">&para;</a></h3>
<p>You can separate multiple patterns with commas (,).</p>
<div class="highlight"><pre><span></span><code>nebula&gt; CREATE TAG INDEX IF NOT EXISTS team_index ON team(name(20));
nebula&gt; REBUILD TAG INDEX team_index;
nebula&gt; MATCH (v1:player{name:&quot;Tim Duncan&quot;}), (v2:team{name:&quot;Spurs&quot;}) \
        RETURN v1,v2;
+----------------------------------------------------+----------------------------------+
| v1                                                 | v2                               |
+----------------------------------------------------+----------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) | (&quot;team204&quot; :team{name: &quot;Spurs&quot;}) |
+----------------------------------------------------+----------------------------------+
</code></pre></div>
<h3 id="match_shortest_paths">Match shortest paths<a class="headerlink" href="#match_shortest_paths" title="Permanent link">&para;</a></h3>
<p>The <code>allShortestPaths</code> function can be used to find all shortest paths between two vertices.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p = allShortestPaths((a:player{name:&quot;Tim Duncan&quot;})-[e*..5]-(b:player{name:&quot;Tony Parker&quot;})) \
        RETURN p;
+------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                  |
+------------------------------------------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})&lt;-[:follow@0 {degree: 95}]-(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt; |
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt; |
+------------------------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<p>The <code>shortestPath</code> function can be used to find a single shortest path between two vertices.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p = shortestPath((a:player{name:&quot;Tim Duncan&quot;})-[e*..5]-(b:player{name:&quot;Tony Parker&quot;})) \
        RETURN p;
+------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                  |
+------------------------------------------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})&lt;-[:follow@0 {degree: 95}]-(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt; |
+------------------------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<h2 id="retrieve_with_multiple_match">Retrieve with multiple match<a class="headerlink" href="#retrieve_with_multiple_match" title="Permanent link">&para;</a></h2>
<p>Multiple <code>MATCH</code> can be used when different patterns have different filtering criteria and return the rows that exactly match the pattern.</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (m)-[]-&gt;(n) WHERE id(m)==&quot;player100&quot; \
        MATCH (n)-[]-&gt;(l) WHERE id(n)==&quot;player125&quot; \
        RETURN id(m),id(n),id(l);
+-------------+-------------+-------------+
| id(m)       | id(n)       | id(l)       |
+-------------+-------------+-------------+
| &quot;player100&quot; | &quot;player125&quot; | &quot;team204&quot;   |
| &quot;player100&quot; | &quot;player125&quot; | &quot;player100&quot; |
+-------------+-------------+-------------+
</code></pre></div>
<h2 id="retrieve_with_optional_match">Retrieve with optional match<a class="headerlink" href="#retrieve_with_optional_match" title="Permanent link">&para;</a></h2>
<p>See <a href="../optional-match/">OPTIONAL MATCH</a>.</p>
<div class="admonition performance">
<p class="admonition-title">Performance</p>
<p>In NebulaGraph, the performance and resource usage of the <code>MATCH</code> statement have been optimized. But we still recommend to use <code>GO</code>, <code>LOOKUP</code>, <code>|</code>, and <code>FETCH</code> instead of <code>MATCH</code> when high performance is required.</p>
</div>





                
              </article>
            </div>
          
          
        </div>
        
      </main>
      
        <footer class="md-footer">
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-copyright">
  
  
    Made with
    <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
      Material for MkDocs
    </a>
  
</div>
      
        <div class="md-social">
  
    
    
    
    
      
      
    
    <a href="https://github.com/vesoft-inc/nebula-docs-cn" target="_blank" rel="noopener" title="github.com" class="md-social__link">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><!--! Font Awesome Free 6.4.2 by @fontawesome - https://fontawesome.com License - https://fontawesome.com/license/free (Icons: CC BY 4.0, Fonts: SIL OFL 1.1, Code: MIT License) Copyright 2023 Fonticons, Inc.--><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
    </a>
  
</div>
      
    </div>
  </div>
</footer>
      
    </div>
    <div class="md-dialog" data-md-component="dialog">
      <div class="md-dialog__inner md-typeset"></div>
    </div>
    
    
    <script id="__config" type="application/json">{"base": "../../..", "features": ["navigation.tabs", "navigation.tabs.sticky"], "search": "../../../assets/javascripts/workers/search.f886a092.min.js", "translations": {"clipboard.copied": "Copied to clipboard", "clipboard.copy": "Copy to clipboard", "search.result.more.one": "1 more on this page", "search.result.more.other": "# more on this page", "search.result.none": "No matching documents", "search.result.one": "1 matching document", "search.result.other": "# matching documents", "search.result.placeholder": "Type to start searching", "search.result.term.missing": "Missing", "select.version": "Select version"}, "version": {"provider": "mike"}}</script>
    
    
      <script src="../../../assets/javascripts/bundle.aecac24b.min.js"></script>
      
    
  </body>
</html>